Revit 2027 API
RebarConstraint.IsEqual Method
 Checks if the specified RebarConstraint is the same as 'this'. The method can be used to determine which of the RebarConstraint candidates offered by the RebarConstraintsManager is currently active.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	RebarConstraint other
)
Public Function IsEqual (
	other As RebarConstraint
) As Boolean
public:
bool IsEqual(
	RebarConstraint^ other
)
member IsEqual :
        other : RebarConstraint -> bool
Parameters
other RebarConstraint
 RebarConstraint to compare with.
Return Value
Boolean
 Returns true if the specified RebarConstraint is the same as 'this', false otherwise
Exceptions
Exception | Condition
ArgumentException |  other is no longer valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  RebarConstraint is no longer valid.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace